# Install command-line tools using Homebrew
# Usage: `brew bundle`

# brew cask for apps
tap 'caskroom/cask'
tap 'caskroom/versions'

# replace default openssl
brew 'openssl'

# shell
brew 'zsh'
brew 'zsh-completions'

# terminal
cask 'iterm2'

# git
brew 'git', args: ['without-completions']
brew 'git-extras'
cask 'rowanj-gitx'

# ruby version manager
brew 'chruby'
brew 'ruby-install'

# other development languages
brew 'node'
brew 'python'
cask 'java'
brew 'go'
brew 'scala'

# database client tools and libs
brew 'postgresql', args: ['no-python']
brew 'redis'
brew 'rabbitmq'
brew 'memcached'

# utils
brew 'coreutils'
brew 'ack'
brew 'the_silver_searcher'
brew 'fasd'
brew 'wget'
brew 'curl'
brew 'ccat'

brew 'awscli'
brew 'terminal-notifier'
brew 'forego'

# editor
brew 'vim', args: ['with-override-system-vi']
brew 'macvim'

# development font
tap 'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'

# browsers
cask 'google-chrome-dev'
cask 'opera'
cask 'opera-developer'
cask 'firefox'
cask 'firefoxdeveloperedition'

# apps
cask 'virtualbox'
cask 'rdm'
cask 'atom'
cask 'flux'
cask 'skype'
cask 'cyberduck'
cask 'ngrok'

# docker for mac
cask 'docker'
